nc: 1
ch: 5

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]                 # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]          # 1-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]]          # 3-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]]
  - [-1, 1, DSConv,  [512, 3, 2]]              # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DSConv,  [1024, 3, 2]]             # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]            # 8

head:
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]   # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                       # 10
  - [ 9, 1, DownsampleConv, []]                                      # 11
  - [[6, 9], 1, FullPAD_Tunnel, []]                                  # 12 (P4 lateral)
  - [[4, 10], 1, FullPAD_Tunnel, []]                                 # 13 (P3 lateral)
  - [[8, 11], 1, FullPAD_Tunnel, []]                                 # 14 (P5 lateral)

  # ---- Top-down 1: Upsample 后用 GABridge(up,lateral)，再 concat(lateral) ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                       # 15
  - [[-1, 12], 1, GABridge, [3, [1, 2, 5, 7]]]                       # 16  ga (C = C_lateral)
  - [[-1, 12], 1, Concat, [1]]                                       # 17  concat(ga, lateral) -> 2C
  - [-1, 2, DSC3k2, [512, True]]                                     # 18
  - [[-1, 9], 1, FullPAD_Tunnel, []]                                 # 19

  # ---- Top-down 2: Upsample 后用 GABridge(up,lateral)，再 concat(lateral) ----
  - [18, 1, nn.Upsample, [None, 2, "nearest"]]                       # 20
  - [[-1, 13], 1, GABridge, [3, [1, 2, 5, 7]]]                       # 21  ga
  - [[-1, 13], 1, Concat, [1]]                                       # 22  concat(ga, lateral) -> 2C
  - [-1, 2, DSC3k2, [256, True]]                                     # 23
  - [10, 1, Conv, [256, 1, 1]]                                       # 24
  - [[23, 24], 1, FullPAD_Tunnel, []]                                # 25

  # ---- Bottom-up: 保持不变 ----
  - [-1, 1, Conv, [256, 3, 2]]                                       # 26
  - [[-1, 19], 1, Concat, [1]]                                       # 27
  - [-1, 2, DSC3k2, [512, True]]                                     # 28
  - [[-1, 9], 1, FullPAD_Tunnel, []]                                 # 29

  - [28, 1, Conv, [512, 3, 2]]                                       # 30
  - [[-1, 14], 1, Concat, [1]]                                       # 31
  - [-1, 2, DSC3k2, [1024, True]]                                    # 32
  - [[-1, 11], 1, FullPAD_Tunnel, []]                                # 33

  - [[25, 29, 33], 1, Detect, [nc]]                                  # 34
