# Parameters
nc: 1 # number of classes
ch: 5 # 输入通道数
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head (修改后)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[8, 6], 1, GABridge, [1024, 512, 3, [1,2,5,7]]]  # 11
  - [-1, 1, SKLayer, []]  # 12
  - [[10, 12], 1, Concat, [1]]  # 13
  - [-1, 3, C2f, [512]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[6, 4], 1, GABridge, [512, 256, 3, [1,2,5,7]]]  # 16
  - [-1, 1, SKLayer, []]  # 17
  - [[15, 17], 1, Concat, [1]]  # 18
  - [-1, 3, C2f, [256]]  # 19

  - [-1, 1, Conv, [256, 3, 2]]  # 20 ✅
  - [[-1, 14], 1, Concat, [1]]  # 21 ✅
  - [-1, 3, C2f, [512]]  # 22 ✅

  - [-1, 1, Conv, [512, 3, 2]]  # 23 ✅
  - [[-1, 9], 1, Concat, [1]]  # 24 ✅
  - [-1, 3, C2f, [1024]]  # 25 ✅

  - [[19, 22, 25], 1, Detect, [nc]]  # ✅ 正确层号


